INSERT INTO author 
    (name, surname)
VALUES
    ('Александр', 'Пушкин'),
    ('Лев', 'Толстой'),
    ('Джордж', 'Оруэлл'),
    ('Федор', 'Достоевский'),
    ('Иван', 'Тургенев');

INSERT INTO book
    (title, description, image_book, file_book, download_allow, created_at)
VALUES
    ('Капитанская дочка', 
    '«Капитанская до́чка» — исторический роман Александра Пушкина, действие которого происходит во время восстания Емельяна Пугачёва. Впервые опубликован без указания имени автора в 4-й книжке журнала «Современник», поступившей в продажу в последней декаде 1836 года.', 
    '/public/storage/books/kapitanskaya_dochka.pdf',
    '/public/storage/images/kapitanskaya_dochka.jpg',
    true,
    '2024-05-01 13:15:30'),
    ('Евгений Онегин', 
    '«Евгений Онегин» (дореф. «Евгеній Онѣгинъ») — роман в стихах русского поэта Александра Сергеевича Пушкина, начат 9 мая 1823 года и закончен 5 октября 1831 года, одно из самых значительных произведений русской словесности. Повествование ведётся от имени безымянного автора, который, впрочем, в первых же строфах называет Онегина «добрый мой приятель». По известному определению В. Г. Белинского, Пушкин назвал «Евгения Онегина» романом в стихах, поскольку в нём изображена «жизнь во всей её прозаической действительности».', 
    '/public/storage/books/evgeniy_onegin.pdf',
    '/public/storage/images/evgeniy_onegin.jpg',
    false,
    '2024-05-03 12:17:10'),
    ('Война и мир', 
    '«Война и мир» — роман-эпопея Льва Николаевича Толстого. Историко-философская мысль автора большей частью проникает в роман не в виде рассуждений, а в гениально схваченных подробностях и цельных картинах, истинный смысл которых нетрудно понять всякому вдумчивому читателю. Писатель старается в любом событии и явлении запечатлеть стихийное, бессознательное начало человеческой жизни. И вся идея романа сводится к тому, что успех и неуспех в исторической жизни зависит не от воли и талантов отдельных людей, а от того, насколько они отражают в своей деятельности стихийный ход исторических событий.', 
    '/public/storage/books/voina_i_mir.epub',
    '/public/storage/images/voina_i_mir.jpg',
    true,
    '2024-05-05 11:28:35'),
    ('1984', 
    '«1984» последняя книга Джорджа Оруэлла, он опубликовал ее в 1949 году, за год до смерти. Роман-антиутопия прославил автора и остается золотым стандартом жанра. Действие происходит в Лондоне, одном из главных городов тоталитарного супергосударства Океания. Пугающе детальное описание общества, основанного на страхе и угнетении, служит фоном для одной из самых ярких человеческих историй в мировой литературе. В центре сюжета судьба мелкого партийного функционера-диссидента Уинстона Смита и его опасный роман с коллегой.', 
    '/public/storage/books/1984.pdf',
    '/public/storage/images/1984.jpg',
    true,
    '2024-05-03 18:17:10');

INSERT INTO genre 
    (title)
VALUES
    ('Классика'), 
    ('Поэзия'),
    ('Роман'),
    ('Военная проза'),
    ('Исторический жанр'),
    ('Антиутопия');

INSERT INTO book_genre
    (book_id, genre_id)
VALUES
    (1, 1),
    (1, 5),
    (2, 1),
    (2, 2),
    (3, 1),
    (3, 3),
    (3, 4),
    (3, 5),
    (4, 1),
    (4, 3),
    (4, 6);

INSERT INTO book_author
    (book_id, author_id)
VALUES
    (1, 1),
    (2, 1),
    (3, 2),
    (4, 3);


